Hi @ganiths , thanks for submitting this! 
Seems I can successfully provision the metric alert with `AppConnections` metric. Could you please help reproduce the error and provide more [logs](https://developer.hashicorp.com/terraform/plugin/log/managing) with `TF_LOG=DEBUG TF_LOG_PATH=./tf.log Terraform apply` command. Thanks.

<details>

```hcl
-> % terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_monitor_metric_alert.alert_connections_exceeds will be created
  + resource "azurerm_monitor_metric_alert" "alert_connections_exceeds" {
      + auto_mitigate            = true
      + description              = "Action will be triggered when connections exceeded"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "wt-ex-windows-function-app-connections_exceeds"
      + resource_group_name      = "wt-exrg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Count"
          + metric_name            = "AppConnections"
          + metric_namespace       = "Microsoft.Web/sites"
          + operator               = "GreaterThan"
          + skip_metric_validation = true
          + threshold              = 100
        }
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "wt-exrg"
    }

  # azurerm_service_plan.example will be created
  + resource "azurerm_service_plan" "example" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "example-app-service-plan"
      + os_type                      = "Windows"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "wt-exrg"
      + sku_name                     = "B1"
      + worker_count                 = (known after apply)
    }

  # azurerm_storage_account.example will be created
  + resource "azurerm_storage_account" "example" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "LRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = true
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "westeurope"
      + min_tls_version                   = "TLS1_2"
      + name                              = "wtndowsfunctionappsa"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "wt-exrg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
    }

  # azurerm_windows_function_app.example will be created
  + resource "azurerm_windows_function_app" "example" {
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = (known after apply)
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "westeurope"
      + name                              = "wt-ex-windows-function-app"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "wt-exrg"
      + service_plan_id                   = (known after apply)
      + site_credential                   = (sensitive value)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "wtndowsfunctionappsa"
      + storage_uses_managed_identity     = false
      + zip_deploy_file                   = (known after apply)

      + site_config {
          + always_on                         = (known after apply)
          + app_scale_limit                   = (known after apply)
          + default_documents                 = (known after apply)
          + detailed_error_logging_enabled    = (known after apply)
          + elastic_instance_minimum          = (known after apply)
          + ftps_state                        = "Disabled"
          + health_check_eviction_time_in_min = (known after apply)
          + http2_enabled                     = false
          + load_balancing_mode               = "LeastRequests"
          + managed_pipeline_mode             = "Integrated"
          + minimum_tls_version               = "1.2"
          + pre_warmed_instance_count         = (known after apply)
          + remote_debugging_enabled          = false
          + remote_debugging_version          = (known after apply)
          + scm_minimum_tls_version           = "1.2"
          + scm_type                          = (known after apply)
          + scm_use_main_ip_restriction       = false
          + use_32_bit_worker                 = true
          + vnet_route_all_enabled            = false
          + websockets_enabled                = false
          + windows_fx_version                = (known after apply)
          + worker_count                      = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
azurerm_resource_group.example: Creating...
azurerm_resource_group.example: Creation complete after 3s [id=/subscriptions/xxx/resourceGroups/wt-exrg]
azurerm_service_plan.example: Creating...
azurerm_storage_account.example: Creating...
azurerm_service_plan.example: Still creating... [10s elapsed]
azurerm_storage_account.example: Still creating... [10s elapsed]
azurerm_service_plan.example: Creation complete after 15s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Web/serverfarms/example-app-service-plan]
azurerm_storage_account.example: Still creating... [20s elapsed]
azurerm_storage_account.example: Still creating... [30s elapsed]
azurerm_storage_account.example: Creation complete after 32s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Storage/storageAccounts/wtndowsfunctionappsa]
azurerm_windows_function_app.example: Creating...
azurerm_windows_function_app.example: Still creating... [10s elapsed]
azurerm_windows_function_app.example: Still creating... [20s elapsed]
azurerm_windows_function_app.example: Still creating... [30s elapsed]
azurerm_windows_function_app.example: Still creating... [40s elapsed]
azurerm_windows_function_app.example: Still creating... [50s elapsed]
azurerm_windows_function_app.example: Still creating... [1m0s elapsed]
azurerm_windows_function_app.example: Creation complete after 1m7s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Web/sites/wt-ex-windows-function-app]
azurerm_monitor_metric_alert.alert_connections_exceeds: Creating...
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [10s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [20s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [30s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [40s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [50s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [1m0s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [1m10s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [1m20s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [1m30s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [1m40s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [1m50s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [2m0s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Still creating... [2m10s elapsed]
azurerm_monitor_metric_alert.alert_connections_exceeds: Creation complete after 2m18s [id=/subscriptions/xxx/resourceGroups/wt-exrg/providers/Microsoft.Insights/metricAlerts/wt-ex-windows-function-app-connections_exceeds]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.
```

</details>